src/Catalogs/рнсНастройкиВыполненияПравил/рнсНастройкиВыполненияПравил.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсНастройкиВыполненияПравил</name>
  <basedOn>Catalog.рнсПравилаПолученияДанныхИБ</basedOn>
  <owners>Catalog.рнсПравилаПолученияДанныхИБ</owners>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеНаборы</name>
    <attributes>
      <name>ИмяНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолучитьПоПравилу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеВнешнегоНабора</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Правило</name>
      <type>
        <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВыполнения</name>
      <type>
        <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыВложенныхПравил</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсПравилаПолученияДанныхИБ/рнсПравилаПолученияДанныхИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсПравилаПолученияДанныхИБ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстЗапросаПоУмолч</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыполнения</name>
    <type>
      <types>EnumRef.рнсВариантВыполненияПравила</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПоУмолчанию</name>
    <type>
      <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКолонкиРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <comment>0 - Стандартный, 1 - По списку настроек, 2 - Расширенный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьСтруктуру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеВозможностиНастроек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерФиксированногоЗапросаВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписокОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/рнсНастройкиВыполненияПравил/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Владелец 				= Неопределено;
	СсылкаНаОбъект 			= Объект.Ссылка;
	РасширенныеВозможности 	= Ложь;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда  	
	
		ДанныеНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаОбъект, 
																	"Владелец, Владелец.СхемаКомпоновкиДанных, ХранилищеНастроекКомпоновкиДанных");
		Владелец = ДанныеНастройки.Владелец;	 		
			
		ИнициализироватьКомпоновщик(ДанныеНастройки.ВладелецСхемаКомпоновкиДанных, ДанныеНастройки.ХранилищеНастроекКомпоновкиДанных);
		
	Иначе  
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда    
			
			ДанныеНастройки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ЗначениеКопирования, 
																	"Владелец, Владелец.СхемаКомпоновкиДанных, ХранилищеНастроекКомпоновкиДанных");
			Владелец = ДанныеНастройки.Владелец;	 		
			
			ИнициализироватьКомпоновщик(ДанныеНастройки.ВладелецСхемаКомпоновкиДанных, ДанныеНастройки.ХранилищеНастроекКомпоновкиДанных)
			
		Иначе
			
			Если ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения) Тогда
				Параметры.ЗначенияЗаполнения.Свойство("Владелец", Владелец);			
			КонецЕсли; 	
			
			Если ЗначениеЗаполнено(Владелец) Тогда 			
				ПолучитьНастройкиПоУмолчаниюНаСервере(Владелец); 			
			Иначе 	 				
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Ввод элемента возможен только из формы элемента справочника Правила получения данных'"),,,, Отказ);  			 
			КонецЕсли;
			
		КонецЕсли; 		 
	        
	КонецЕсли;
	                 
	Если ЗначениеЗаполнено(Владелец) Тогда  		
		ПараметрыФО 			= Новый Структура("рнсПравилоПолученияДанных", Владелец);
		РасширенныеВозможности 	= ПолучитьФункциональнуюОпцию("рнсРасширенныеВозможностиНастроек", ПараметрыФО);  		
	КонецЕсли; 
	
	Элементы.СтраницаТекстЗапроса.Видимость			= ЗначениеЗаполнено(Объект.ТекстЗапроса);
	Элементы.СтраницаПользовательскиеПоля.Видимость = РасширенныеВозможности;
	Элементы.СтраницаУсловноеОформление.Видимость 	= РасширенныеВозможности;
	Элементы.СтраницаВыбор.Видимость 				= РасширенныеВозможности;
	Элементы.СтраницаСтруктура.Видимость 			= РасширенныеВозможности; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи) 
	
	Если Модифицированность И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗаписи, "ВопросЗадан", Ложь) Тогда
		                
		Если НеобходимоПодтвердитьЗапись(КомпоновщикНастроек) Тогда
			
			Отказ 			= Истина;
			Оповещение 		= Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтотОбъект, ПараметрыЗаписи);
			ТекстВопроса 	= НСтр("ru = 'Нет обязательных параметров в настройках. Продолжить?'");
			
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);			
			
		КонецЕсли;  
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки()); 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьНастройки(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		АдресДвоичныеДанные = ПоместитьНастройкиВХранилище(УникальныйИдентификатор);		
		
		Если АдресДвоичныеДанные <> Неопределено Тогда				
			
			ПараметрыСохранения 								= ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
			ПараметрыСохранения.Диалог.Заголовок 				= НСтр("ru = 'Выберите файл для сохранения'");
			ПараметрыСохранения.Диалог.МножественныйВыбор 		= Ложь;
			ПараметрыСохранения.Диалог.ПредварительныйПросмотр 	= Ложь;				
	
			ФайловаяСистемаКлиент.СохранитьФайл(Неопределено, АдресДвоичныеДанные, 
														Объект.Код, ПараметрыСохранения);			
			
		КонецЕсли; 		
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура;  
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНастройкиПоУмолчанию(Команда)
	ПолучитьНастройкиПоУмолчаниюНаСервере(Объект.Владелец);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыПоУмолчанию(Команда)
	ПолучитьНастройкиПоУмолчаниюНаСервере(Объект.Владелец, 1);
КонецПроцедуры  

&НаКлиенте
Процедура ПолучитьОтборыПоУмолчанию(Команда)
	ПолучитьНастройкиПоУмолчаниюНаСервере(Объект.Владелец, 2);	
КонецПроцедуры  

&НаКлиенте
Процедура ДополнитьИспользованнымиОтборами(Команда)  	
	ПолучитьНастройкиПоУмолчаниюНаСервере(Объект.Владелец, 3);	
КонецПроцедуры  

&НаКлиенте
Процедура РедактироватьЗапрос(Команда)
	
	Элементы.ТекстЗапроса.Доступность = Истина;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		Если Записать(ПараметрыЗаписи) И ПараметрыЗаписи.Свойство("Закрыть") Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура ИнициализироватьКомпоновщик(ХранилищеСхемы, ХранилищеНастоек)
	
	Схема 				= ХранилищеСхемы.Получить();
	НастройкиСКД 		= ХранилищеНастоек.Получить();		
	АдресХранения 		= ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	ИсточникНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранения); 
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек); 		
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСКД);
	
КонецПроцедуры  

&НаСервере
Процедура ПолучитьНастройкиПоУмолчаниюНаСервере(Владелец, ТипОперации = 0)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаПравил.ХранилищеНастроекКомпоновкиДанных КАК ХранилищеНастроекКомпоновкиДанных,
	|	ТаблицаПравил.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных
	|ИЗ
	|	Справочник.рнсПравилаПолученияДанныхИБ КАК ТаблицаПравил
	|ГДЕ
	|	ТаблицаПравил.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Владелец);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();			
	ВыборкаДетальныеЗаписи.Следующий();		
	
	СКД = ВыборкаДетальныеЗаписи.СхемаКомпоновкиДанных.Получить();
	НастройкиСКД = ВыборкаДетальныеЗаписи.ХранилищеНастроекКомпоновкиДанных.Получить();
	
	Если ТипЗнч(СКД) = Тип("СхемаКомпоновкиДанных") Тогда  			 
		
		КопияТекущихНастроек 	= ОбщегоНазначения.ЗначениеИзСтрокиXML(ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.Настройки));
		НастройкиПоУмолчанию 	= Неопределено;
		АдресХранения 			= ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор());					
		ИсточникНастроек 		= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранения); 			
		КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
		
		Если НастройкиСКД = Неопределено Тогда
			НастройкиПоУмолчанию = СКД.НастройкиПоУмолчанию;
		Иначе
			НастройкиПоУмолчанию = НастройкиСКД; 									
		КонецЕсли; 		
		
		Если НастройкиПоУмолчанию <> Неопределено Тогда  			
			             								
			Если ТипОперации = 1 Тогда 	
				КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);
				КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
				СкопироватьЭлементыОтбора(КопияТекущихНастроек.Отбор, КомпоновщикНастроек.Настройки.Отбор);				
			ИначеЕсли ТипОперации = 2 Тогда    				
				КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию);				
			ИначеЕсли ТипОперации = 3 Тогда 
				СкопироватьЭлементыОтбора(НастройкиПоУмолчанию.Отбор, КомпоновщикНастроек.Настройки.Отбор, Истина); 			
			Иначе
				КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПоУмолчанию); 			
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура СкопироватьЭлементыОтбора(Источник, Приемник, ТолькоИспользованные = Ложь)  
	        	         
	Для каждого Ит Из Источник.Элементы Цикл
		Если НЕ ТолькоИспользованные ИЛИ ТолькоИспользованные И Ит.Использование Тогда 					
			Если ТипЗнч(Ит) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда                                                                                                                                         	
				СкопироватьЭлементыОтбора(Ит, ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Приемник, Ит.Представление, Ит.ТипГруппы), ТолькоИспользованные)		
			Иначе	
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Приемник, Ит.ЛевоеЗначение, Ит.ПравоеЗначение, Ит.ВидСравнения, Ит.Представление, Ит.Использование, Ит.РежимОтображения, Ит.ИдентификаторПользовательскойНастройки);	
			КонецЕсли;
		КонецЕсли;    						
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПоместитьНастройкиВХранилище(Идентификатор)
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ТекстXML  = ОбщегоНазначения.ЗначениеВСтрокуXML(Настройки);  	
	Результат = ПоместитьВоВременноеХранилище(ПолучитьДвоичныеДанныеИзСтроки(ТекстXML), Идентификатор);
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция НеобходимоПодтвердитьЗапись(КомпоновщикНастроек)
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	Возврат НЕ рнсСлужебный.ЕстьОбязательныеПараметры(НастройкиКомпоновки);
	
КонецФункции 

#КонецОбласти
